<?php
//字典定义
return [

	//资金渠道
	'bank_type' => [
		1 => '微众',
		10 => '新网'
	],

        'new_business_types' => [
        '0_PS01_1' => '二手车 - 半价-抵押贷',
        '0_PS04_1' => '二手车 - 半价-组合贷',
        '0_PS02_1' => '二手车 - 分期-抵押贷',
        '0_PS03_1' => '二手车 - 分期-组合贷',
        '0_PS05_1' => '二手车 - 直批-325',
        '0_PS06_1' => '二手车 - 直批-370',
        '0_PS07_1' => '二手车 - 超融-505',
        '0_PS08_1' => '二手车 - 超融-550',
        '0_PS09_1' => '二手车 - 超融-325',
        '0_PS10_1' => '二手车 - 超融-370',
        '0_PS21_1' => '二手车 - 分期-190',
        '0_PS22_1' => '二手车 - 分期-145',
        '0_PS23_1' => '二手车 - 直租-190',
        '0_PS33_1' => '二手车 - 直租超融-190',
        '0_PS31_1' => '二手车 - 超融-190',
        '0_PS32_1' => '二手车 - 超融-145',
        '0_PS42_1' => '二手车(新) - 分期-抵押贷',
        '0_PS44_1' => '二手车(新) - 直批-370',
        '0_PS45_1' => '二手车(新) - 分期-190',
        '0_PS46_1' => '二手车(新) - 直租-190',
        '0_PS47_1' => '二手车(新) - 老客户直租-190',
        '0_PS52_1' => '二手车(新) - 超融-550',
        '0_PS54_1' => '二手车(新) - 超融-370',
        '0_PS55_1' => '二手车(新) - 超融-190',
        '0_PS56_1' => '二手车(新) - 直租超融-190',
        '0_PS57_1' => '二手车(新) - 老客户直租超融-190',
    ],
	//新网人脸识别结果
	'xinwang_face_ret' => [
		0 => '通过',
		1 => '拒绝',
		3 => '审核中',
		4 => '超时',
		99 => '已提交新网',
	],

	'clr_type' => [
		0 => '未结清',
		1 => '15天内退车',
		2 => '客户违约强制收车',
		3 => '提前还车',
		4 => '提前还款',
		5 => '强制提前结清',
		6 => '正常结清',
		-1 => '未放款退车',
		-2 => '过户失败',
	],
    //提交渠道
//    'submit_entry' => [
//        'APP' => 'APP',
//        'WAP' => 'WAP', //M站
//        'WEB' => 'PC',
//        'SALEBABY' => '销售宝',
//        'H5' => 'H5',
//        'YXT_QR' => '车伯乐-优信通扫码',
//        'WECHAT_SMALL' => '车伯乐-微信小程序',
//        'XCB' => '车伯乐-新车宝',
//        'YXT' => '车伯乐-优信通',
//        'CBL' => '车伯乐-APP',
//        'OTHER' => '其他',   //无法查询到渠道的归类为其他
//    ],
    'submit_entry' => [
        'B' => '商家端',
        'XSB' => '超级宝',
		'XCB' => '新车宝',
    ],
    //APP,WAP,WEB(PC),SALEBABY(销售宝),H5,XCB(新车宝),YXT_QR(优信通扫码),MYSTERY(神秘渠道),OTHER(其他)
	'finance_status' => [
		-1 => '交易取消',
		100 => '确定签署合同',
		200 => '首付款已付',
		300 => '面签结束',
		310 => '风控审核不通过',
		350 => '凯枫电子签完成',
		400 => '电子签完成（材料未提交）',
		410 => '材料提交',
		420 => '初审通过',
		430 => '复审通过',
		440 => '总监未确认',
		441 => '总监确认',
		500 => '抵押未提交',
		509 => '抵押审批驳回',
		510 => '抵押提交',
		520 => '抵押审批通过(放车申请未提交)',
		529 => '放车审批驳回',
		530 => '放车申请提交',
		540 => '放车申请初审通过',
		550 => '放车申请复审通过',
	],


    //面签状态
    'interview_status' => [
        1 => '未排队',
        2 => '排队中',
        3 => '处理中',
        4 => '视频中',
        5 => '审核通过',
        6 => '审核拒绝',
        7 => '跳过面签',
        8 => '重新排队',
        9 => '待领取',
        10 => '挂起等候',
        11 => '挂起排队',
    ],

	//智能面签状态
	'visa_status' => [
		1 => '未排队',
		2 => '待处理',
		3 => '处理中',
		4 => '视频中',
		5 => '审核通过',
		6 => '审核拒绝',
		7 => '跳过面签',
		8 => '重新排队',
        9 => '排队中',
        10 => '挂起等候',
        11 => '挂起排队',
	],

    //面签结果状态
    'visa_result_status' => [
        -1 => '异常',
        -2 => '超时',
        5 => '通过',
        6 => '拒绝',
        7 => '跳过面签',
        8 => '重新排队',
        10 => '用户挂起'
    ],
];